Repository: H0SAM7/ansolineCalc
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appTitle
source: Insulin Calculator
ar: حاسبة الأنسولين

# welcome
source: Welcome to Insulin Calculator
ar: مرحباً بك في حاسبة الأنسولين

# setupSubtitle
source: Please enter your insulin parameters to get started
ar: يرجى إدخال معاملات الأنسولين الخاصة بك للبدء

# insulinSensitivityFactor
source: Insulin Sensitivity Factor (ISF)
ar: عامل حساسية الأنسولين

source: Carbohydrate Ratio
ar: نسبة الكربوهيدرات

# isfHint
source: e.g., 50
ar: مثال: 50

# carbRatioHint
source: e.g., 15
ar: مثال: 15

# isfUnit
source: mg/dL per unit
ar: مجم/ديسيلتر لكل وحدة

# carbRatioUnit
source: grams per unit
ar: جرام لكل وحدة

# isfDescription
source: How much 1 unit of insulin lowers blood glucose
ar: كم تخفض وحدة واحدة من الأنسولين من مستوى السكر

# carbRatioDescription
source: How many grams of carbs 1 unit of insulin covers
ar: كم جرام من الكربوهيدرات تغطيه وحدة واحدة من الأنسولين

source: Save Settings
ar: حفظ الإعدادات

# settingsSaved
source: Settings saved successfully!
ar: تم حفظ الإعدادات بنجاح!

source: Current Blood Glucose
ar: مستوى السكر الحالي في الدم

source: Carbohydrates Intake
ar: كمية الكربوهيدرات

# glucoseHint
source: Enter blood glucose level
ar: أدخل مستوى السكر في الدم

# carbsHint
source: Enter carbohydrates amount
ar: أدخل كمية الكربوهيدرات

# glucoseUnit
source: mg/dL
ar: مجم/ديسيلتر

# carbsUnit
source: grams
ar: جرام

source: Calculate Dose
ar: احسب الجرعة

# clearFields
source: Clear
ar: مسح

# recommendedDose
source: Recommended Insulin Dose
ar: الجرعة الموصى بها من الأنسولين

source: units
ar: وحدة

# safetyWarning
source: Always consult your healthcare provider
ar: استشر طبيبك دائماً

# safetyInfo
source: Important Safety Information
ar: معلومات السلامة المهمة

# safetyText
source: • This app is for educational purposes only • Always verify calculations with your healthcare provider • Monitor blood glucose levels regularly • Seek immediate medical attention for emergencies
ar: • هذا التطبيق للأغراض التعليمية فقط • تحقق دائماً من الحسابات مع طبيبك • راقب مستويات السكر في الدم بانتظام • اطلب الرعاية الطبية الفورية في حالات الطوارئ

source: Settings
ar: الإعدادات

source: Save Changes
ar: حفظ التغييرات

# resetSettings
source: Reset All Settings
ar: إعادة تعيين جميع الإعدادات

# resetConfirmTitle
source: Reset Settings
ar: إعادة تعيين الإعدادات

# resetConfirmText
source: Are you sure you want to reset all settings? This will clear your saved parameters.
ar: هل أنت متأكد من أنك تريد إعادة تعيين جميع الإعدادات؟ سيؤدي هذا إلى مسح المعاملات المحفوظة.

source: Cancel
ar: إلغاء

source: Reset
ar: إعادة تعيين

# settingsUpdated
source: Settings updated successfully!
ar: تم تحديث الإعدادات بنجاح!

# aboutSettings
source: About These Settings
ar: حول هذه الإعدادات

# aboutSettingsText
source: These values should be determined by your healthcare provider based on your individual needs. They may change over time and should be regularly reviewed.
ar: يجب تحديد هذه القيم من قبل طبيبك بناءً على احتياجاتك الفردية. قد تتغير بمرور الوقت ويجب مراجعتها بانتظام.

# pleaseEnterISF
source: Please enter ISF value
ar: يرجى إدخال قيمة عامل الحساسية

# pleaseEnterCarbRatio
source: Please enter carb ratio value
ar: يرجى إدخال قيمة نسبة الكربوهيدرات

# pleaseEnterGlucose
source: Please enter blood glucose level
ar: يرجى إدخال مستوى السكر في الدم

# pleaseEnterCarbs
source: Please enter carbohydrates amount
ar: يرجى إدخال كمية الكربوهيدرات

# enterValidNumber
source: Please enter a valid number
ar: يرجى إدخال رقم صحيح

# realisticGlucose
source: Please enter a realistic glucose value
ar: يرجى إدخال قيمة سكر واقعية

# realisticCarbs
source: Please enter a realistic carb value
ar: يرجى إدخال قيمة كربوهيدرات واقعية

source: Language
ar: اللغة

source: Current Value
ar: القيمة الحالية

source: Update Settings
ar: تحديث الإعدادات

# updateSubtitle
source: Modify your insulin calculation parameters
ar: تعديل معاملات حساب الأنسولين الخاصة بك

# setupTitle
source: Setup
ar: الإعداد

# enterRealisticISF
source: Please enter a realistic ISF value (1-1000)
ar: يرجى إدخال قيمة واقعية لعامل الحساسية (1-1000)

# enterRealisticCarbRatio
source: Please enter a realistic carb ratio (1-100)
ar: يرجى إدخال نسبة كربوهيدرات واقعية (1-100)

source: About App
ar: حول التطبيق

# appSubtitle
source: Your Health Companion
ar: رفيقك الصحي

source: Developed By
ar: تحت اشراف

source: App Features
ar: مميزات التطبيق

# feature1Title
source: Accurate Calculations
ar: حسابات دقيقة

# feature1Description
source: Uses proven medical formulas for insulin dose calculation
ar: يستخدم الصيغ الطبية المعتمدة لحساب جرعة الأنسولين

# feature2Title
source: Multilingual Support
ar: دعم متعدد اللغات

# feature2Description
source: Available in Arabic and English with proper RTL support
ar: متوفر باللغتين العربية والإنجليزية مع دعم الكتابة من اليمين لليسار

# feature3Title
source: Secure & Private
ar: آمن وخاص

# feature3Description
source: All data is stored locally on your device
ar: جميع البيانات محفوظة محلياً على جهازك

# feature4Title
source: Modern Design
ar: تصميم حديث

# feature4Description
source: Beautiful, accessible, and easy-to-use interface
ar: واجهة جميلة وسهلة الاستخدام ومتاحة للجميع

source: Medical Disclaimer
ar: إخلاء المسؤولية الطبية

# disclaimerText
source: This application is designed for educational purposes and as a calculation aid. It should not replace professional medical advice, diagnosis, or treatment. Always consult with qualified healthcare professionals before making any medical decisions. The developers are not responsible for any medical outcomes resulting from the use of this application.
ar: هذا التطبيق مصمم للأغراض التعليمية وكمساعد في الحسابات. لا يجب أن يحل محل الاستشارة الطبية المهنية أو التشخيص أو العلاج. استشر دائماً المختصين في الرعاية الصحية المؤهلين قبل اتخاذ أي قرارات طبية. المطورون غير مسؤولين عن أي نتائج طبية ناتجة عن استخدام هذا التطبيق.

source: Contact Us
ar: اتصل بنا

# contactText
source: For support, feedback, or medical consultations, please contact our medical team:
ar: للدعم والملاحظات أو الاستشارات الطبية، يرجى التواصل مع فريقنا الطبي:

source: Email
ar: البريد الإلكتروني

source: Phone
ar: الهاتف

source: All rights reserved
ar: جميع الحقوق محفوظة
